app/controllers/exercises_controller.rb

  def index
    @day = Day.find(params[:day_id])
    @exercises = @day.exercises.all
---
SELECT "exercises".* FROM "exercises"